Catalogs/ТипыАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТипыАвторабот</Name>
			<Comment>Типы авторабот</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРесурсаПланирования</Name>
					<Comment>Тип ресурса планирования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРесурсовАвтоматическогоПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРазбиенияИнтерваловПриПланировании</Name>
					<Comment>Вид разбиения интервалов при планировании</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРазбиенияИнтерваловПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыРесурсовАвтоматическогоПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыРесурсовАвтоматическогоПланирования</Name>
			<Comment>Типы ресурсов автоматического планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРабочимМестам</Name>
					<Comment>По рабочим местам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИсполнителям</Name>
					<Comment>По исполнителям</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРазбиенияИнтерваловПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыРазбиенияИнтерваловПланирования</Name>
			<Comment>Виды разбиения интервалов планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разбивать</Name>
					<Comment>Разбивать</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРазбивать</Name>
					<Comment>Не разбивать</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыАвторабот/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Типы авторабот"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника Организации.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//                                  Например:
//                                    Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                    ЭлементТЧ = Элемент.Ключи.Добавить();
//                                    ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Приемка";
	Элемент.Код                       = "0000000001";
	Элемент.Наименование              = НСтр("ru = 'Приемка'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.РеквизитДопУпорядочивания = 1;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Выдача";
	Элемент.Код                       = "0000000002";
	Элемент.Наименование              = НСтр("ru = 'Выдача'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.РеквизитДопУпорядочивания = 2;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных             = "ПоУмолчанию";
	Элемент.Код                                   = "0000000003";
	Элемент.Наименование                          = НСтр("ru = 'По умолчанию'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.ТипРесурсаПланирования                = Перечисления.ТипыРесурсовАвтоматическогоПланирования.ПоРабочимМестам;
	Элемент.ВидРазбиенияИнтерваловПриПланировании = Перечисления.ВидыРазбиенияИнтерваловПланирования.Разбивать;
	Элемент.РеквизитДопУпорядочивания             = 3;
	
КонецПроцедуры

Процедура ОбновлениеНомеровЭлементов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыАвторабот.Ссылка КАК Ссылка,
	|	ТипыАвторабот.Код КАК Код
	|ИЗ
	|	Справочник.ТипыАвторабот КАК ТипыАвторабот
	|ГДЕ
	|	ТипыАвторабот.Код = ""0000000003""
	|	И НЕ ТипыАвторабот.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыАвторабот.ПоУмолчанию)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.УстановитьНовыйКод();
		
		Попытка
			СправочникОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр(
					"ru = 'Ошибка обновления справочника Типы авторабот'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
				),
				УровеньЖурналаРегистрации.Предупреждение,
				, ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	 Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#КонецЕсли
